In [1]:
#import necessary libraries
import pandas as pd
import numpy as np

In [2]:
#create a list of 10 numbers
L=list(range(10))

In [3]:
#change type of list to string
[str(i) for i in L]

['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']

In [4]:
#cut a list
L[:5]

[0, 1, 2, 3, 4]

In [5]:
L[::2]

[0, 2, 4, 6, 8]

In [6]:
#concotenate 2 list
np.concatenate([L[:5],L[1::3]])

array([0, 1, 2, 3, 4, 1, 4, 7])

In [7]:
#Create a DataFrame
data=pd.DataFrame({'Name':['Laya','Leila'],'Age':[32,40]})

In [8]:
#Summary of Data
data.describe()

             Age
count   2.000000
mean   36.000000
std     5.656854
min    32.000000
25%    34.000000
50%    36.000000
75%    38.000000
max    40.000000

In [9]:
#Type of each column
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
Age     2 non-null int64
Name    2 non-null object
dtypes: int64(1), object(1)
memory usage: 112.0+ bytes

In [10]:
#Sort the Data
data.sort_values(by=['Age','Name'],ascending = True,inplace=False)

   Age   Name
0   32   Laya
1   40  Leila

In [11]:
Data=pd.DataFrame({'Name':['L','L','L','P'],'Age':[1,2,2,3]})

In [12]:
#Delete duplicates from a Data Frame
Data.drop_duplicates()

   Age Name
0    1    L
1    2    L
3    3    P

In [13]:
#Create a Function
def f(x):
    if x==1:
        return 'One'
    elif x==2:
        return 'Two'
    else:
        return 'Noting'

In [15]:
#Map 2 tables 
data = pd.DataFrame({'Food':['pig','lamb','chicken','beef'],'Ounces':[24,3,4,5]})
data

      Food  Ounces
0      pig      24
1     lamb       3
2  chicken       4
3     beef       5

In [16]:
meat_to_animal = {'pig':'S','lamb':'b','chicken':'f','beef':'g'}

In [23]:
#Map 2 tables 
data['animal']=data['Food'].map(meat_to_animal)
data

      Food  Ounces animal
0      pig      24      S
1     lamb       3      b
2  chicken       4      f
3     beef       5      g

In [24]:
#Assign new columns to an existance table
data=data.assign(new_var=data['Ounces']*10)
data

      Food  Ounces animal  new_var
0      pig      24      S      240
1     lamb       3      b       30
2  chicken       4      f       40
3     beef       5      g       50

In [25]:
#Drop a column from a table
data.drop('new_var',axis='columns',inplace=True)
data

      Food  Ounces animal
0      pig      24      S
1     lamb       3      b
2  chicken       4      f
3     beef       5      g

In [26]:
#Filter the dataframe
data.query('Ounces>4 & Ounces>5')
data

      Food  Ounces animal
0      pig      24      S
1     lamb       3      b
2  chicken       4      f
3     beef       5      g

In [27]:
#Create a pivot tables
data.pivot_table(values='Ounces',index='animal',aggfunc='count')

        Ounces
animal
S            1
b            1
f            1
g            1